# PANDAS

Pandas es una libreria de Python muy usada en ciencia de datos en combinación con Numpy y Matplotlib.

Pandas -> Gestión de datos

Numpy -> Operaciones númericas

Matplotlib -> Construcción de gráficos

instalar: pip install pandas

importar: import pandas as pd

In [89]:
import pandas as pd
import math
import numpy as np

Series

In [90]:
# Creación de las estructuras de datos
asig = ["Matematicas", "Historia", "Lengua", "Filosofia", "Dibujo"]
calificaciones = [10, 3, 2, 5, 6]
dicc = {"Matematicas": 10, "Historia": 3, "Lengua": 2, "Filosofia": 5, "Dibujo": 6}

# Creación de las series de datos a partir de las estructuras anteriores
materias = pd.Series(asig, index = list(range(1,6)), dtype = "string")
notas = pd.Series(calificaciones, index = list(range(1,6)), dtype = "int32")
clase = pd.Series(dicc)

In [91]:
# Visualización de las series de datos declaradas en el apartado anterior
print(f"Materias:\n{materias}")
print(f"Notas:\n{notas}")
print(f"Clase:\n{clase}")

Materias:
1    Matematicas
2       Historia
3         Lengua
4      Filosofia
5         Dibujo
dtype: string
Notas:
1    10
2     3
3     2
4     5
5     6
dtype: int32
Clase:
Matematicas    10
Historia        3
Lengua          2
Filosofia       5
Dibujo          6
dtype: int64

In [92]:
# Ejemplos de informacion usados sobre series de datos
print(f"Tipo de objeto en pandas: {type(materias)}")
print(f"Tipo de elementos presentes en la serie: {materias.dtype}")
print(f"Cantidad de elementos presentes en la serie: {materias.size}")
print(f"Cantidad de elementos presentes en la serie: {materias.index}")

Tipo de objeto en pandas: <class 'pandas.core.series.Series'>
Tipo de elementos presentes en la serie: string
Cantidad de elementos presentes en la serie: 5
Cantidad de elementos presentes en la serie: Index([1, 2, 3, 4, 5], dtype='int64')

In [93]:
# Ejemplos de metodos usados sobre series de datos
print(f"Contaje de los elementos de la serie: {notas.count():.2f}")
print(f"Suma de todos los elementos de la serie: {notas.sum():.2f}")
print(f"Suma acumulada de los elementos de la serie: {notas.cumsum()}")
print(f"Minimo de todos los elementos de la serie: {notas.min():.2f}")
print(f"Maximo de todos los elementos de la serie: {notas.max():.2f}")
print(f"Desviación tipica de todos los elementos de la serie: {notas.std():.2f}")
print(f"Varianza de todos los elementos de la serie: {notas.var():.2f}")
print(f"Media de todos los elementos de la serie: {notas.mean():.2f}")
print(f"Descripción estadistica de los datos de la serie: {notas.describe()}")

Contaje de los elementos de la serie: 5.00
Suma de todos los elementos de la serie: 26.00
Suma acumulada de los elementos de la serie: 1    10
2    13
3    15
4    20
5    26
dtype: int64
Minimo de todos los elementos de la serie: 2.00
Maximo de todos los elementos de la serie: 10.00
Desviación tipica de todos los elementos de la serie: 3.11
Varianza de todos los elementos de la serie: 9.70
Media de todos los elementos de la serie: 5.20
Descripción estadistica de los datos de la serie: count     5.000000
mean      5.200000
std       3.114482
min       2.000000
25%       3.000000
50%       5.000000
75%       6.000000
max      10.000000
dtype: float64

In [94]:
# También se puede operar sobre una serie
print(f"Multiplicación de los elementos de la serie por un número: {notas*0.8}")
print(f"Aplicar una función sobre los elementos de la serie: {notas.apply(math.log)}")

Multiplicación de los elementos de la serie por un número: 1    8.0
2    2.4
3    1.6
4    4.0
5    4.8
dtype: float64
Aplicar una función sobre los elementos de la serie: 1    2.302585
2    1.098612
3    0.693147
4    1.609438
5    1.791759
dtype: float64

In [95]:
# Ordenar los valores con el metodo sort
print(f"Ordenar una serie por valores:\n{clase.sort_values(ascending=True)}")
print(f"Ordenar una serie por indices:\n{clase.sort_index(ascending=False)}")

Ordenar una serie por valores:
Lengua          2
Historia        3
Filosofia       5
Dibujo          6
Matematicas    10
dtype: int64
Ordenar una serie por indices:
Matematicas    10
Lengua          2
Historia        3
Filosofia       5
Dibujo          6
dtype: int64

In [96]:
# Creamos un nuevo diccionario y su serie con pandas
dicc2 = {"Matematicas": 10, "Historia": 3, "Lengua": 2, "Filosofia": 5, "Dibujo": 6, "Biologia": None}
clase2 = pd.Series(dicc2)
clase2

Matematicas    10.0
Historia        3.0
Lengua          2.0
Filosofia       5.0
Dibujo          6.0
Biologia        NaN
dtype: float64

In [97]:
clase2.dropna() # Elimina el Nan

Matematicas    10.0
Historia        3.0
Lengua          2.0
Filosofia       5.0
Dibujo          6.0
dtype: float64

### DataFrames

In [98]:
nomCol = ["Nombre", "Altura", "Peso"] # Tilulos de las columnas
nomInd = ["Suj1", "Suj2", "Suj3", "Suj4"] # Titulos de las filas o indices
datos = {
  "nom": ["Alberto", "Maria", "Mercedes", "Lorena"],
  "alt": [1.80, 1.50, 1.65, 1.72],
  "pes": [80, 72, 45, 66]
}

In [99]:
# Creamos el dataframe 'df' a partir de los datos anteriores
df = pd.DataFrame(datos)
df

        nom   alt  pes
0   Alberto  1.80   80
1     Maria  1.50   72
2  Mercedes  1.65   45
3    Lorena  1.72   66

In [100]:
# Definimos titulos para las columnas y para las filas
df.columns = nomCol # Cambiar el titulo de las columnas
df.index = nomInd # Cambiar el titulo de las filas
df

        Nombre  Altura  Peso
Suj1   Alberto    1.80    80
Suj2     Maria    1.50    72
Suj3  Mercedes    1.65    45
Suj4    Lorena    1.72    66

In [101]:
df.info() # Información general del dataframe

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Suj1 to Suj4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nombre  4 non-null      object
 1   Altura  4 non-null      float64
 2   Peso    4 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [102]:
df.size # Numero de datos (filas * columnas)

12

In [103]:
df.head(2)  # Datos de las 2 primeras filas

       Nombre  Altura  Peso
Suj1  Alberto     1.8    80
Suj2    Maria     1.5    72

In [104]:
df.tail(2)  # Datos de las 2 ultimas filas

        Nombre  Altura  Peso
Suj3  Mercedes    1.65    45
Suj4    Lorena    1.72    66

In [105]:
df.iloc[:2, :2] # Acceder a ciertos valores de la tabla marcando unos rangos [indices, filas]

       Nombre  Altura
Suj1  Alberto     1.8
Suj2    Maria     1.5

In [106]:
df["Altura"] # Acceder a los valores de una variable

Suj1    1.80
Suj2    1.50
Suj3    1.65
Suj4    1.72
Name: Altura, dtype: float64

In [107]:
df.index = [0,1,2,3]
df.index

Index([0, 1, 2, 3], dtype='int64')

In [108]:
coef = pd.Series([False, True, False, False], dtype=bool) # Creamos una nueva serie con valores booleanos
coef

0    False
1     True
2    False
3    False
dtype: bool

In [109]:
df["IMC"] = coef  # Añadimos una columna al dataframe
df

     Nombre  Altura  Peso    IMC
0   Alberto    1.80    80  False
1     Maria    1.50    72   True
2  Mercedes    1.65    45  False
3    Lorena    1.72    66  False

In [110]:
df["IMC"] = df["Peso"] / df["Altura"]**2  # Añadimos una nueva columna "IMC", que es resultado de operar con otras variables
df

     Nombre  Altura  Peso        IMC
0   Alberto    1.80    80  24.691358
1     Maria    1.50    72  32.000000
2  Mercedes    1.65    45  16.528926
3    Lorena    1.72    66  22.309356

In [111]:
df["Sobreperso"] = df["IMC"] >= 25  # Añadimos una nueva columna "Sobrepeso" con los valores de en funcion de otra variable
df

     Nombre  Altura  Peso        IMC  Sobreperso
0   Alberto    1.80    80  24.691358       False
1     Maria    1.50    72  32.000000        True
2  Mercedes    1.65    45  16.528926       False
3    Lorena    1.72    66  22.309356       False

In [112]:
df["logIMC"] = df["IMC"].apply(math.log)  # Añadimos una nueva columna "logIMC" con los valores resultantes de aplicar una función en los valores de otra columna
df

     Nombre  Altura  Peso        IMC  Sobreperso    logIMC
0   Alberto    1.80    80  24.691358       False  3.206453
1     Maria    1.50    72  32.000000        True  3.465736
2  Mercedes    1.65    45  16.528926       False  2.805112
3    Lorena    1.72    66  22.309356       False  3.105006

In [113]:
df.iloc[0,0] = np.nan # Eliminamos el primer nombre
df.iloc[0,1] = np.nan # Eliminamos la primera altura
df

     Nombre  Altura  Peso        IMC  Sobreperso    logIMC
0       NaN     NaN    80  24.691358       False  3.206453
1     Maria    1.50    72  32.000000        True  3.465736
2  Mercedes    1.65    45  16.528926       False  2.805112
3    Lorena    1.72    66  22.309356       False  3.105006

In [114]:
# Ejemplos de metodos usados sobre el dataframe 'df'
print(f"Contaje de elementos de una columna que no son NaN: {df["Nombre"].count()}")
print(f"Suma de los valores de los elementos de una columna: {df["Altura"].sum()}")
print(f"Media de valores de los elementos de una columna: {df["Altura"].mean()}")
print(f"Minimo de los valores de los elementos de una columna: {df["Altura"].min()}")
print(f"Máximo de los valores de los elementos de una columna: {df["Altura"].max()}")
print(f"Varianza de los valores de los elementos de una columna: {df["Altura"].var()}")
print(f"Desviación tipica de los valores de los elementos de una columna: {df["Altura"].std()}")
print(f"Covarianza de los valores de los elementos de una columna:\n{df[["IMC", "Peso"]].cov()}\n") # Para sacar la covarianza necesitamos dos valores
print(f"Coeficiente de correlación de las variables de un dataframe:\n{df[["Altura", "Peso"]].corr()}\n") # Para sacar el coeficiente de correlación necesitamos dos valores
print(f"Resumen general de un dataframe:\n{df.describe()}") # Devuelve el count, mean, std, min, percentiles (25%, 50%, 75%) y max. (min seria el percentil 0% y max el 100%)

Contaje de elementos de una columna que no son NaN: 3
Suma de los valores de los elementos de una columna: 4.87
Media de valores de los elementos de una columna: 1.6233333333333333
Minimo de los valores de los elementos de una columna: 1.5
Máximo de los valores de los elementos de una columna: 1.72
Varianza de los valores de los elementos de una columna: 0.012633333333333328
Desviación tipica de los valores de los elementos de una columna: 0.11239810200058241
Covarianza de los valores de los elementos de una columna:
            IMC        Peso
IMC   41.032631   71.484661
Peso  71.484661  224.250000

Coeficiente de correlación de las variables de un dataframe:
          Altura      Peso
Altura  1.000000 -0.407902
Peso   -0.407902  1.000000

Resumen general de un dataframe:
         Altura       Peso        IMC    logIMC
count  3.000000   4.000000   4.000000  4.000000
mean   1.623333  65.750000  23.882410  3.145577
std    0.112398  14.974979   6.405672  0.273112
min    1.500000  45.000000  16.528926  2.805112
25%    1.575000  60.750000  20.864249  3.030033
50%    1.650000  69.000000  23.500357  3.155730
75%    1.685000  74.000000  26.518519  3.271274
max    1.720000  80.000000  32.000000  3.465736

In [115]:
df["AltPes"] = df["Altura"] + df["Peso"]  # Al operar se pueden dar casos que el resultado sea NaN
df

     Nombre  Altura  Peso        IMC  Sobreperso    logIMC  AltPes
0       NaN     NaN    80  24.691358       False  3.206453     NaN
1     Maria    1.50    72  32.000000        True  3.465736   73.50
2  Mercedes    1.65    45  16.528926       False  2.805112   46.65
3    Lorena    1.72    66  22.309356       False  3.105006   67.72

In [116]:
df.pop("AltPes")  # Borra la columna
# del df["AltPes"]  df.pop() y del df[] hacen lo mismo
df

     Nombre  Altura  Peso        IMC  Sobreperso    logIMC
0       NaN     NaN    80  24.691358       False  3.206453
1     Maria    1.50    72  32.000000        True  3.465736
2  Mercedes    1.65    45  16.528926       False  2.805112
3    Lorena    1.72    66  22.309356       False  3.105006

In [117]:
f4 = pd.Series(["Mario", 1.73, 66, np.nan, False, np.nan])  # Creamos una nueva serie 'f4'
f4.to_frame() # Con el metodo to_frame(), convertimos la serie en un dataframe

       0
0  Mario
1   1.73
2     66
3    NaN
4  False
5    NaN

In [118]:
f4.to_frame().T # Dataframe f4 transpuesto

       0     1   2    3      4    5
0  Mario  1.73  66  NaN  False  NaN

In [123]:
df.columns = [0, 1, 2, 3, 4, 5]
df.index

Index([0, 1, 2, 3], dtype='int64')

# Conceptos avanzados de pandas

In [124]:
pd.concat([df, f4.to_frame().T]), ignore_index = True

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (152903674.py, line 1)